WMSGIFT/src/Documents/Маршрутизация/Маршрутизация.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Маршрутизация</name>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Транспорт</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Водитель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипТС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Грузоподъемность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Прицеп</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГосНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВесДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерИсточника</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ДокументыМаршрута</name>
    <attributes>
      <name>Заказ</name>
      <type>
        <types>DocumentRef.ЗаказПокупателя</types>
      </type>
    </attributes>
    <attributes>
      <name>ОчередьДоставки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

WMSGIFT/src/InformationRegisters/итWMSЗадачиТСД/итWMSЗадачиТСД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>итWMSЗадачиТСД</name>
  <resources>
    <name>ИдентификаторУпаковки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>172</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЯчейкаОтправитель</name>
    <type>
      <types>CatalogRef.итСкладскиеЯчейки</types>
    </type>
  </resources>
  <resources>
    <name>ЯчейкаПолучатель</name>
    <type>
      <types>CatalogRef.итСкладскиеЯчейки</types>
    </type>
  </resources>
  <resources>
    <name>ДополнительныеДанные</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Состояние</name>
    <type>
      <types>EnumRef.итWMSСостоянияЗадачТСД</types>
    </type>
  </attributes>
  <attributes>
    <name>ФиксацияЗадачи</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДанныеДокументаТСД</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <dimensions>
    <name>ТСД</name>
    <type>
      <types>CatalogRef.итWMSСправочникТСД</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.итWMSКонтрольнаяОперацияАгрегации</types>
      <types>DocumentRef.итWMSРазмещение</types>
      <types>DocumentRef.итWMSЗадачиИнвентаризации</types>
      <types>DocumentRef.итWMSПроверка</types>
      <types>DocumentRef.итWMSНаборка</types>
      <types>DocumentRef.итWMSПеремещение</types>
      <types>DocumentRef.итWMSОтгрузка</types>
      <types>DocumentRef.итWMSПриемка</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипЗадачи</name>
    <type>
      <types>EnumRef.итWMSТипыЗадачТСД</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдЗадачи</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдЗадачиРодителя</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

WMSGIFT/src/InformationRegisters/итWMSСостояниеТСД/итWMSСостояниеТСД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>итWMSСостояниеТСД</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>РаботникСклада</name>
    <type>
      <types>CatalogRef.итWMSРаботникиСклада</types>
    </type>
  </resources>
  <resources>
    <name>Роль</name>
    <type>
      <types>CatalogRef.итWMSРолиРаботниковСклада</types>
    </type>
  </resources>
  <resources>
    <name>ТерриторияСклада</name>
    <type>
      <types>CatalogRef.итТерриторииСкладов</types>
    </type>
  </resources>
  <resources>
    <name>Состояние</name>
    <type>
      <types>EnumRef.итWMSСостоянияТСД</types>
    </type>
  </resources>
  <dimensions>
    <name>ТСД</name>
    <type>
      <types>CatalogRef.итWMSСправочникТСД</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

WMSGIFT/src/Documents/РеализацияТоваровУслуг/РеализацияТоваровУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РеализацияТоваровУслуг</name>
  <basedOn>Document.итWMSНаборка</basedOn>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Сделка</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.итWMSНаборка</types>
    </type>
  </attributes>
  <attributes>
    <name>итКоличествоВозвратнойТары</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>СерияНоменклатуры</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ХарактеристикаНоменклатуры</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмеренияМест</name>
      <type>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Качество</name>
      <type>
        <types>CatalogRef.Качество</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

WMSGIFT/src/Documents/итWMSОтгрузка/итWMSОтгрузка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>итWMSОтгрузка</name>
  <basedOn>Document.итWMSНаборка</basedOn>
  <basedOn>Document.Маршрутизация</basedOn>
  <registerRecords>AccumulationRegister.итТоварыВЯчейках</registerRecords>
  <attributes>
    <name>итОснование</name>
    <type>
      <types>DocumentRef.итWMSНаборка</types>
      <types>DocumentRef.итWMSПеремещение</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусДокумента</name>
    <type>
      <types>EnumRef.итWMSСтатусыСкладскихДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>СнимокТабличнойЧастиДоРаспределения</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗавершенияДокумента</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>НеРаспределятьНаТСД</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтгрузочныеВорота</name>
    <type>
      <types>CatalogRef.итСкладскиеЯчейки</types>
    </type>
  </attributes>
  <attributes>
    <name>СозданНаОснованиСерверногоВызова</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторУпаковки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>172</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>СерияНоменклатуры</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Качество</name>
      <type>
        <types>CatalogRef.Качество</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаРозлива</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЯчейкаОтправитель</name>
      <type>
        <types>CatalogRef.итСкладскиеЯчейки</types>
      </type>
    </attributes>
    <attributes>
      <name>СостояниеЗадачи</name>
      <type>
        <types>EnumRef.итWMSСостоянияЗадачТСД</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Наборка</name>
      <type>
        <types>DocumentRef.итWMSНаборка</types>
      </type>
    </attributes>
    <attributes>
      <name>ОчередностьПогрузки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФиксацияСтроки</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПричинаОтменыЗадачи</name>
      <type>
        <types>CatalogRef.итWMS_ПричиныОтменыЗадач</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>итОснования</name>
    <attributes>
      <name>Документ</name>
      <type>
        <types>DocumentRef.ЗаказПокупателя</types>
        <types>DocumentRef.итWMSНаборка</types>
        <types>DocumentRef.Маршрутизация</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

WMSGIFT/src/Documents/Маршрутизация/ObjectModule.bsl
Процедура ПечатьМаршрутногоЛиста(ТабличныйДокумент,Маршрут) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МаршрутизацияДокументыМаршрута.Заказ КАК Заказ,
		|	МаршрутизацияДокументыМаршрута.ОчередьДоставки КАК ОчередьДоставки
		|ПОМЕСТИТЬ Вт1
		|ИЗ
		|	Документ.Маршрутизация.ДокументыМаршрута КАК МаршрутизацияДокументыМаршрута
		|ГДЕ
		|	МаршрутизацияДокументыМаршрута.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	МаршрутизацияДокументыМаршрута.Заказ,
		|	МаршрутизацияДокументыМаршрута.ОчередьДоставки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Вт1.Заказ КАК Заказ,
		|	итWMSНаборка.Ссылка КАК Наборка,
		|	Вт1.Заказ.Комментарий КАК Комментарий,
		|	Вт1.ОчередьДоставки КАК ОчередьДоставки
		|ПОМЕСТИТЬ Вт2
		|ИЗ
		|	Вт1 КАК Вт1
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.итWMSНаборка КАК итWMSНаборка
		|		ПО Вт1.Заказ = итWMSНаборка.итОснование
		|			И (итWMSНаборка.Проведен)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Вт2.Заказ КАК Заказ,
		|	Вт2.Наборка КАК Наборка,
		|	Вт2.Комментарий КАК Комментарий,
		|	РеализацияТоваровУслуг.Ссылка КАК Реализация,
		|	Вт2.Заказ.Контрагент КАК Контрагент,
		|	Вт2.ОчередьДоставки КАК ОчередьДоставки
		|ИЗ
		|	Вт2 КАК Вт2
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|		ПО Вт2.Заказ = РеализацияТоваровУслуг.Сделка
		|			И (РеализацияТоваровУслуг.Проведен)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ОчередьДоставки";
	
	Запрос.УстановитьПараметр("Ссылка", Маршрут);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Макет=ПолучитьМакет("МаршрутныйЛистПечать");
	ОбластьШапка=Макет.ПолучитьОбласть("Шапка");
	ОбластьПодвал=Макет.ПолучитьОбласть("Подвал");
	ТабличныйДокумент.Вывести(ОбластьШапка);
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	ОбластьСтрока=Макет.ПолучитьОбласть("Строка");
	ОбластьСтрока.Параметры.Контрагент=ВыборкаДетальныеЗаписи.Контрагент;
	ОбластьСтрока.Параметры.НомерЗаказа=ВыборкаДетальныеЗаписи.Заказ.НомерИсточника;
	ОбластьСтрока.Параметры.НомерНаборки=ВыборкаДетальныеЗаписи.Наборка.Номер;
	ОбластьСтрока.Параметры.Очередь=ВыборкаДетальныеЗаписи.ОчередьДоставки;
	ОбластьСтрока.Параметры.НомерРеализации=ВыборкаДетальныеЗаписи.Реализация.Номер;
	ОбластьСтрока.Параметры.Комментарий =ВыборкаДетальныеЗаписи.Комментарий;
	ТабличныйДокумент.Вывести(ОбластьСтрока);
	КонецЦикла;
	ОбластьПодвал.Параметры.Транспорт=Маршрут.Транспорт;
	ОбластьПодвал.Параметры.водитель=Маршрут.водитель;
    ОбластьПодвал.Параметры.госномер=Маршрут.госномер;
    ОбластьПодвал.Параметры.Отгрузил=НайтиИсполнителяМаршрута(Маршрут);
	МассивОбластей=новый Массив;
	МассивОбластей.Добавить(ОбластьПодвал);
	Если не ТабличныйДокумент.ПроверитьВывод(МассивОбластей) Тогда 
		ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
	КонецЕсли;
	ТабличныйДокумент.Вывести(ОбластьПодвал);
КонецПроцедуры





Функция НайтиИсполнителяМаршрута(Маршрут)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	МаршрутизацияДокументыМаршрута.Заказ КАК Заказ
		|ПОМЕСТИТЬ Вт
		|ИЗ
		|	Документ.Маршрутизация.ДокументыМаршрута КАК МаршрутизацияДокументыМаршрута
		|ГДЕ
		|	МаршрутизацияДокументыМаршрута.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	МаршрутизацияДокументыМаршрута.Заказ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	итWMSНаборка.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ Вт2
		|ИЗ
		|	Вт КАК Вт
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.итWMSНаборка КАК итWMSНаборка
		|		ПО Вт.Заказ = итWMSНаборка.итОснование
		|			И (итWMSНаборка.Проведен)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	итWMSОтгрузкаитОснования.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ВтОтгрузка
		|ИЗ
		|	Вт2 КАК Вт2
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.итWMSОтгрузка.итОснования КАК итWMSОтгрузкаитОснования
		|		ПО Вт2.Ссылка = итWMSОтгрузкаитОснования.Документ
		|			И (итWMSОтгрузкаитОснования.Ссылка.Проведен)
		|
		|СГРУППИРОВАТЬ ПО
		|	итWMSОтгрузкаитОснования.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	итWMSЗадачиТСД.ТСД КАК ТСД,
		|	МИНИМУМ(итWMSЗадачиТСД.ДатаНачала) КАК ДатаНачала,
		|	МАКСИМУМ(итWMSЗадачиТСД.ДатаОкончания) КАК ДатаОкончания
		|ПОМЕСТИТЬ ДатаИсполненияотгрузкиНаТСД
		|ИЗ
		|	ВтОтгрузка КАК ВтОтгрузка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.итWMSЗадачиТСД КАК итWMSЗадачиТСД
		|		ПО ВтОтгрузка.Ссылка = итWMSЗадачиТСД.ДокументОснование
		|
		|СГРУППИРОВАТЬ ПО
		|	итWMSЗадачиТСД.ТСД
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	итWMSСостояниеТСД.РаботникСклада КАК РаботникСклада
		|ИЗ
		|	(ВЫБРАТЬ
		|		итWMSСостояниеТСД.ТСД КАК ТСД,
		|		МАКСИМУМ(итWMSСостояниеТСД.Период) КАК Период
		|	ИЗ
		|		ДатаИсполненияотгрузкиНаТСД КАК ДатаИсполненияотгрузкиНаТСД
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.итWMSСостояниеТСД КАК итWMSСостояниеТСД
		|			ПО ДатаИсполненияотгрузкиНаТСД.ТСД = итWMSСостояниеТСД.ТСД
		|				И ДатаИсполненияотгрузкиНаТСД.ДатаНачала >= итWMSСостояниеТСД.Период
		|	
		|	СГРУППИРОВАТЬ ПО
		|		итWMSСостояниеТСД.ТСД) КАК ВложенныйЗапрос
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.итWMSСостояниеТСД КАК итWMSСостояниеТСД
		|		ПО ВложенныйЗапрос.ТСД = итWMSСостояниеТСД.ТСД
		|			И ВложенныйЗапрос.Период = итWMSСостояниеТСД.Период";
	
	Запрос.УстановитьПараметр("Ссылка", Маршрут);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	Возврат  ВыборкаДетальныеЗаписи.РаботникСклада;
	КонецЦикла;
	Возврат "";
	
	КонецФункции
